Revit 2027 API
BuiltInFailures.ConnectorFailures.InvalidLoadClassificationValue Property
 The load classification parameter cannot be empty. Please select a valid load classification element for the connector parameter and the associated family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidLoadClassificationValue { get; }
Public Shared ReadOnly Property InvalidLoadClassificationValue As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidLoadClassificationValue {
	FailureDefinitionId^ get ();
}
static member InvalidLoadClassificationValue : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace